# Токен бота
token = '5212521293:AAHJmvtFdPKLEFOqQfM53R_Vc5Y5jag-EPQ'

# Константы базы данных
host = 'pg2.sweb.ru'
user = 'v4tograpru_lex'
password = 'AlexCoolBoy22'
database = 'v4tograpru_lex'
port = 5432

# Админы
admins = [126668370, 244607176]

# --- Тексты ---
start_text = '''Привет!
Здесь ты будешь получать сообщения о изменениях в космических событиях и о том, как это может быть полезно или хорошо именно тебе.

Будем вместе держать руку на пульсе космической «погоды»
Обнимаю, твой астролог, Люда!
'''




# --- Тексты для админов ---
admin_text = '''Вы админ. Поздравляю!'''

send_forecast = '''Впишите текст прогноза'''

send_date = '''Впишите дату и время, в которое необходимо отправить сообщение в следующем формате
ДД.ММ.ГГГГ ЧЧ:ММ'''

success_append_forecast = '''Прогноз успешно добавлен'''

success_del = '''Прогноз удалён'''

empty_forecasts = '''Запланированных прогнозов нет'''

date_format_error = '''Дата и время написаны не по шаблону'''

date_time_error = '''Вы вписали уже прошедшую дату и время'''

# --- Тексты для клиента ---
if_subscribe_yes = '''Теперь вы будете получать астрологические прогнозы. Если желаете их отключить, пропишите команду /subscribe'''

if_subscribe_no = '''Теперь вы не будете получать астрологические прогнозы. Если желаете их включить, пропишите команду /subscribe'''

subscribe_questions = '''Хотите ли вы получать астрологические прогнозы?'''


eighteen_one = '''Аспект озарений и внезапных новостей

Меркурий Соединяется с Ураном в тельце

Меркурий – планета информации, логического мышления и общения. Сегодня день неожиданных новостей! Инфополю еще есть, чем нас удивить)

А если подумать, как использовать этот аспект? Этот аспект хорош для работы с информацией, благоприятен для напряжения ума. Разобраться с документами, решить дела по учебе, сесть за написание статьи, которая долго «не шла» или изучение урока, курса, программы.

И Меркурий, и Уран связаны с технологиями и средствами связи – компьютерами, телефонами и прочей электроникой. Изучать новые программы, чистить файлы на компьютере, - просто замечательный план. 

Сильным аспект будет до 23 апреля
'''

eighteen_two = '''Аспект креативного творчества

Венера в рыбах делает секстиль к Урану в тельце.

Венера планета финансов и любви, в рыбах – творческом, духовном, милосердном знаке ей хорошо и спокойно. Гармоничный аспект, который она делает к Урану – это подъем творческих, артистических энергий. Интерес к искусству, особенно современному. Приход денег нетрадиционным путем. Или внезапно вспыхнувшие чувства.

Рекомендую найти время для творчества – напиши абстрактную картину, приготовь новое, необычное блюдо, поэкспериментируй со стилем – может, ты давно хотела себе в гардероб мужской пиджак или забавные туфли с длинными носами, но не решалась?
Этот день настал! Попробуй!

Сильным аспект будет до 23 апреля
'''

eighteen_three = '''Аспект внутреннего напряжения

Солнце сделает квадрат к Плутону в Козероге

На этом аспекте ты можешь почувствовать внутреннее напряжение, зачастую вытесняемое на подсознательный план. Плутон -  планета, отвечающая за все глобальное, масштабное, неподвластное нам – как стихийные бедствия или действия правительств. А Солнце – это наш внутренний свет, центр воли и принятия решений. 

Как правило, такой аспект действует недолго, и не влечет за собой ярких событий в жизни отдельного человека, если не включены в его индивидуальную карту, но! Ощущение подавленности и бессилия он может принести. Перед тем, что больше нас и чем мы управлять не можем.

Постарайся меньше читать новости сейчас, и помни – это пройдет. Попробуй переключиться на хобби, домашние дела и своих близких.
Сильным аспект будет до 24 апреля
'''