eighteen_one = '''Аспект озарений и внезапных новостей

Меркурий Соединяется с Ураном в тельце

Меркурий – планета информации, логического мышления и общения. Сегодня день неожиданных новостей! Инфополю еще есть, чем нас удивить)

А если подумать, как использовать этот аспект? Этот аспект хорош для работы с информацией, благоприятен для напряжения ума. Разобраться с документами, решить дела по учебе, сесть за написание статьи, которая долго «не шла» или изучение урока, курса, программы.

И Меркурий, и Уран связаны с технологиями и средствами связи – компьютерами, телефонами и прочей электроникой. Изучать новые программы, чистить файлы на компьютере, - просто замечательный план. 

Сильным аспект будет до 23 апреля
'''

eighteen_two = '''Аспект креативного творчества

Венера в рыбах делает секстиль к Урану в тельце.

Венера планета финансов и любви, в рыбах – творческом, духовном, милосердном знаке ей хорошо и спокойно. Гармоничный аспект, который она делает к Урану – это подъем творческих, артистических энергий. Интерес к искусству, особенно современному. Приход денег нетрадиционным путем. Или внезапно вспыхнувшие чувства.

Рекомендую найти время для творчества – напиши абстрактную картину, приготовь новое, необычное блюдо, поэкспериментируй со стилем – может, ты давно хотела себе в гардероб мужской пиджак или забавные туфли с длинными носами, но не решалась?
Этот день настал! Попробуй!

Сильным аспект будет до 23 апреля
'''

eighteen_three = '''Аспект внутреннего напряжения

Солнце сделает квадрат к Плутону в Козероге

На этом аспекте ты можешь почувствовать внутреннее напряжение, зачастую вытесняемое на подсознательный план. Плутон -  планета, отвечающая за все глобальное, масштабное, неподвластное нам – как стихийные бедствия или действия правительств. А Солнце – это наш внутренний свет, центр воли и принятия решений. 

Как правило, такой аспект действует недолго, и не влечет за собой ярких событий в жизни отдельного человека, если не включены в его индивидуальную карту, но! Ощущение подавленности и бессилия он может принести. Перед тем, что больше нас и чем мы управлять не можем.

Постарайся меньше читать новости сейчас, и помни – это пройдет. Попробуй переключиться на хобби, домашние дела и своих близких.
Сильным аспект будет до 24 апреля
'''