# Токен бота
meditation_token = '5267243589:AAF6vGBHEqWuvwR93g3uQflQtXPBW8rH6aA'

base_pay_url = 'https://yoomoney.ru/quickpay/confirm.xml?' \
               'receiver=4100117596986931&' \
               'quickpay-form=shop&' \
               'targets=Осознанные+медитации&' \
               'paymentType=SB&' \
               'sum={}'
admins = [126668370, 244607176]


full_price = 12000
half_of_prise = 6000
date = '15 марта'
full_price_link = 't.me/+kJZ1UhGT368yM2My'
half_link = 't.me//+A6epkGVd7qdjZmUy'


# Константы базы данных
host = 'pg2.sweb.ru'
user = 'v4tograpru_lex'
password = 'AlexCoolBoy22'
database = 'v4tograpru_lex'
port = 5432
table = 'meditation_users'


# --- Тексты ---
# Главный экран
start_text = '''Забрать свои медитации до 1 апреля❤️'''

half_text = '''Для тех, кому сейчас сложно, мы сделали возможность взять половинку - 6 медитаций и 12 дней вместе'''

final_text = '''Мы с тобой милая
Начнем наши медитации и путь тепла
{} заходи в канал - '''


mail_text = '''Милая, привет✨
С понедельника случайные карты приходят реже: не каждый день, а раз в три дня - не хочу перегружать вас. Сейчас тревога ушла и пришло время действовать❤️ Пусть карты и их послания всегда приходят вовремя! Читайте сердцем💫

Спасибо за ваши отзывы и горячие слова! Мне очень важно получать их!! Это даёт силы продолжать и делать для вас еще и еще!!

По вашим просьбам мы сделали возможность Сказать мне спасибо - если вы подучили ценность, завершить баланс Вселенной🙌

Обнимаю вас🌸'''


take_meditation = '''Забрать свои медитации'''


tutor = 'Чтобы отправить сообщение всем пользователям бота, впишите его после команды /massmail'