visit_consultation1 = 'Важно не то, что нарисовано, а то, что ты чувствуешь по своему вопросу в ответ на ' \
                     'такую карту💫 \nЧтобы глубже понять свой вопрос и ответы, запишись на консультацию - ' \
                     '@Daria_stepanischeva'

visit_consultation2 = 'Порой сложно понять карту, потому что она отвечает на ДРУГОЙ вопрос. ' \
                      'Что для тебя в том, что здесь изображено? Консультация - @Daria_stepanischeva'

visit_consultation3 = 'На этом всё. Если ответ не найден - дай ему время. А завтра снова сможешь вытянуть карту❤️'

visit_consultation = [visit_consultation1, visit_consultation2, visit_consultation3]

end = 'В день можно взять только три карты'

today_card = '''Твоя метафорическая карта на сегодня'''

massmailing_text = '''Милая, хочешь получать персональные метафорические послания каждый день?
Предлагаю оформить подписку: 490 руб - и два недели каждое утро тебе будет приходить карта, настраивающая на важное, создающее намерение на весь твой день💫'''
